In [28]:
# index = True, index = False
# True 는 인덱스의 행(숫자)까지 보이게한다.
import csv
import pandas as pd

input_file = 'supplier_data.csv'
output_file5 = 'output_files/5output_basic_pandas.csv'

data = pd.read_csv(input_file)

data

   Supplier Name Invoice Number  Part Number     Cost Purchase Date
0     Supplier X       001-1001         2341  $500.00       1/20/14
1     Supplier X       001-1001         2341  $500.00       1/20/14
2     Supplier X       001-1001         5467  $750.00       1/20/14
3     Supplier X       001-1001         5467  $750.00       1/20/14
4     Supplier Y        50-9501         7009  $250.00       1/30/14
5     Supplier Y        50-9501         7009  $250.00       1/30/14
6     Supplier Y        50-9505         6650  $125.00        2/3/14
7     Supplier Y        50-9505         6650  $125.00        2/3/14
8     Supplier Z       920-4803         3321  $610.00        2/3/14
9     Supplier Z       920-4804         3321  $615.00       2/10/14
10    Supplier Z       920-4805         3321  $615.00       2/17/14
11    Supplier Z       920-4806         3321  $615.00       2/24/14

In [29]:
data1 = data.loc[data['Invoice Number'].str.contains('001')]

data1

  Supplier Name Invoice Number  Part Number     Cost Purchase Date
0    Supplier X       001-1001         2341  $500.00       1/20/14
1    Supplier X       001-1001         2341  $500.00       1/20/14
2    Supplier X       001-1001         5467  $750.00       1/20/14
3    Supplier X       001-1001         5467  $750.00       1/20/14

In [30]:
data.to_csv(output_file5, index = False)

In [31]:
output_file6 = 'output_files/6output_basic_pandas.csv'

data2 = data[['Supplier Name','Cost']]
data2

   Supplier Name     Cost
0     Supplier X  $500.00
1     Supplier X  $500.00
2     Supplier X  $750.00
3     Supplier X  $750.00
4     Supplier Y  $250.00
5     Supplier Y  $250.00
6     Supplier Y  $125.00
7     Supplier Y  $125.00
8     Supplier Z  $610.00
9     Supplier Z  $615.00
10    Supplier Z  $615.00
11    Supplier Z  $615.00

In [32]:
data2.to_csv(output_file6, index = False)

In [33]:
output_file7 = 'output_files/7output_basic_pandas.csv'

data3 = data[['Invoice Number','Purchase Date']]
data3

   Invoice Number Purchase Date
0        001-1001       1/20/14
1        001-1001       1/20/14
2        001-1001       1/20/14
3        001-1001       1/20/14
4         50-9501       1/30/14
5         50-9501       1/30/14
6         50-9505        2/3/14
7         50-9505        2/3/14
8        920-4803        2/3/14
9        920-4804       2/10/14
10       920-4805       2/17/14
11       920-4806       2/24/14

In [34]:
data3.to_csv(output_file7, index = False)